{"_id":{"$oid":"573a1395f29313caabce2ac7"},"plot":"The life, times and afflictions of the fifteenth-century Russian iconographer.","genres":["Biography","Drama","History"],"runtime":205,"rated":"NOT RATED","title":"Andrei Rublev","num_mflix_comments":1,"countries":["Soviet Union"],"languages":["Russian","Italian","Tatar"],"directors":["Andrei Tarkovsky"],"year":1966,"imdb":{"rating":8.4,"votes":21476,"id":60107},"type":"movie","metacritic":76}
{"_id":{"$oid":"573a13f9f29313caabdeb320"},"plot":"For anyone who has not fully understood the controversial Bitcoin yet, this is a concise and informative crash course about Money and Crypto Currencies.","genres":["Documentary","News"],"runtime":60,"title":"Bitcoin: The End of Money as We Know It","fullplot":"Bitcoin: The End Of Money As We Know It traces the history of money from the bartering societies of the ancient world to the trading floors of Wall St. The documentary exposes the practices of central banks and the dubious financial actors who brought the world to its knees in the last crisis. It highlights the Government influence on the money creation process and how it causes inflation. Moreover, this film explains how most money we use today is created out of thin air by banks when they create debt. Epic in scope, this film examines the patterns of technological innovation and questions everything you thought you knew about money. Is Bitcoin an alternative to national currencies backed by debt? Will Bitcoin and cryptocurrency spark a revolution in how we use money peer to peer? Is it a gift to criminals? Or is it the next bubble waiting to burst? If you trust in your money just as it is - this film has news for you.","languages":["English"],"directors":["Torsten Hoffmann","Michael Watchulonis"],"writers":["Torsten Hoffmann"],"lastupdated":"2015-09-17 04:02:35.527000000","year":2015,"imdb":{"rating":7.1,"votes":210,"id":4654844},"countries":["Australia","Canada","USA","UK"],"type":"movie","metacritic":1}
{"_id":{"$oid":"573a1394f29313caabcdf1ad"},"fullplot":"Umberto Ferrari, aged government-pensioner, attends a street demonstration held by his fellow pensioners. The police dispense the crowd and Umberto returns to his cheap furnished room which he shares with his dog Flick. Umberto's lone friend is Maria, servant of the boarding house. She is a simple girl who is pregnant by one of two soldiers and neither will admit to being the father. When Umberto's landlady Antonia demands the rent owed her and threatens eviction if she is not paid, Umberto tries desperately to raise the money by selling his books and watch. He is too proud to beg in the streets and can not get a loan from any of his acquaintances. He contracts a sore throat, is admitted to a hospital and this puts a delay on his financial difficulty. Discharged, he finds that his dog is gone and, following a frantic search, locates him in the city dog pound. His room has been taken over by the landlady and the now-homeless Unberto determines to find a place for his beloved dog, and then kill himself. Unsuccessful, he resolves that his dog must die with him and he stands in the path of a train, with his dog in his arms.","imdb":{"rating":8.2,"votes":15468,"id":45274},"year":1952,"plot":"A elderly man and his dog struggle to survive on his government pension in Rome.","genres":["Drama"],"rated":"NOT RATED","metacritic":92,"title":"Umberto D.","languages":["Italian"],"writers":["Cesare Zavattini (story)"],"type":"movie","num_mflix_comments":2,"countries":["Italy"],"runtime":89}
{"_id":{"$oid":"573a1391f29313caabcd7e30"},"plot":"A dramatized account of a great Russian naval mutiny and a resulting street demonstration which brought on a police massacre.","genres":["History","War"],"runtime":66,"rated":"UNRATED","num_mflix_comments":1,"title":"Battleship Potemkin","fullplot":"Based on the historical events the movie tells the story of a riot at the battleship Potemkin. What started as a protest strike when the crew was given rotten meat for dinner ended in a riot. The sailors raised the red flag and tried to ignite the revolution in their home port Odessa.","languages":["Russian"],"writers":["Nina Agadzhanova (script by)"],"lastupdated":"2015-08-18 00:22:19.750000000","year":1925,"imdb":{"rating":8,"votes":36901,"id":15648},"countries":["Soviet Union"],"type":"movie","metacritic":1}
{"_id":{"$oid":"573a13f0f29313caabdd9697"},"plot":"Anger consumes a squad of combat vets years after they return from the front. The dozen warriors in Of Men and War come home to the United States, but their minds are stuck out on the ...","genres":["Documentary","History","War"],"runtime":142,"title":"Of Men and War","num_mflix_comments":1,"countries":["France","Switzerland","USA"],"fullplot":"Anger consumes a squad of combat vets years after they return from the front. The dozen warriors in Of Men and War come home to the United States, but their minds are stuck out on the battlefield. Like figures from a Greek tragedy, all have traumatic memories that haunt them to this day. Ghosts and echoes of the war fill their lives. Wives, children, and parents bear the brunt of their fractured spirits. At The Pathway Home, a pioneering PTSD therapy center, the protagonists resolve to end the ongoing destruction. Their therapist is a Vietnam vet himself, helping the boys forge meaning from their senseless trauma. Over years of therapy, Of Men and War explores their grueling paths to recovery, as they attempt to make peace with themselves, their past, and their families.","languages":["English"],"directors":["Laurent Bècue-Renard"],"writers":["Laurent Bècue-Renard","Laurent Bècue-Renard"],"lastupdated":"2015-05-07 00:55:19.617000000","year":2014,"imdb":{"rating":6.9,"votes":41,"id":3704008},"type":"movie","metacritic":1}
{"_id":{"$oid":"573a13dbf29313caabdb061a"},"plot":"In 1940, a struggling poor young man falls for a girl who must pay a terrible price to save her mentally disabled brother by marring a powerful shrewed businessman. Then Rotterdam Blitz, a devastating German bombardment, begins.","genres":["Drama","History","War"],"runtime":105,"title":"Het Bombardement","fullplot":"In 1940, a struggling poor young man falls for a girl who must pay a terrible price to save her mentally disabled brother by marring a powerful shrewed businessman. Then Rotterdam Blitz, a devastating German bombardment, begins.","languages":["Dutch"],"directors":["Ate de Jong"],"writers":["Ate de Jong","Paul Ruven"],"lastupdated":"2015-08-20 00:46:04.127000000","year":2012,"imdb":{"rating":3.8,"votes":1279,"id":2363219},"countries":["Netherlands"],"type":"movie","tomatoes":{"viewer":{"rating":2.5,"numReviews":1},"lastUpdated":{"$date":"2015-09-03T19:14:22Z"}},"metacritic":1}